pangaea/app/views/pages/home.html.erb

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
        <%= f.select :genderpreference, ['Only Male','Only Female', 'Must Include Male', 'Must Include Female', 'Does Not Matter'], class: 'input-1' %>
        <% if !current_user.profile.collegeemail.blank? %>