app/views/chatrooms/index.html.erb

SELECT "chatrooms".* FROM "chatrooms" INNER JOIN "chatroom_users" ON "chatrooms"."id" = "chatroom_users"."chatroom_id" WHERE "chatroom_users"."user_id" = ?  [["user_id", 1]]
SELECT  "chatroom_users".* FROM "chatroom_users" WHERE "chatroom_users"."chatroom_id" = ? AND "chatroom_users"."user_id" = ? ORDER BY "chatroom_users"."id" ASC LIMIT ?  [["chatroom_id", 1], ["user_id", 1], ["LIMIT", 1]]
---
				<ul>
					<% current_user.chatrooms.each do |chatroom| %>
						<% @currentchatroomuser = chatroom.chatroom_users.where(user_id: current_user.id).first %>

SELECT "requests".* FROM "requests" WHERE "requests"."chatroom_id" = ? ORDER BY created_at DESC  [["chatroom_id", 1]]
---

						<% x.requests.order("created_at DESC").each do |t| %>

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
								<% if @chatroom_user.admin == true %>
								<li><% @conversationrequest = User.find(t.user_id) %><% @conversationrequest = User.find(@conversationrequest.id) %>

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
      	         				</div>&nbsp;
								<%= link_to @conversationrequest.profile.first_name, user_path(:id => @conversationrequest.id) %>&nbsp;has requested to join&nbsp;<%= x.title %></li>

SELECT "requests".* FROM "requests" WHERE "requests"."user_id" = ?  [["user_id", 1]]
---
				<ul>
					<% current_user.requests.each do |x| %>