app/views/chatrooms/show.html.erb

SELECT  "chatroom_users".* FROM "chatroom_users" WHERE "chatroom_users"."chatroom_id" = ? AND "chatroom_users"."user_id" = ? ORDER BY "chatroom_users"."id" ASC LIMIT ?  [["chatroom_id", 1], ["user_id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "chatroom_users" WHERE "chatroom_users"."chatroom_id" = ? AND "chatroom_users"."user_id" = ? LIMIT ?  [["chatroom_id", 1], ["user_id", 1], ["LIMIT", 1]]
SELECT "chatrooms".* FROM "chatrooms" INNER JOIN "chatroom_users" ON "chatrooms"."id" = "chatroom_users"."chatroom_id" WHERE "chatroom_users"."user_id" = ?  [["user_id", 1]]
---
	<div class="row">
		<% if @chatroom.chatroom_users.exists?(user_id: current_user.id) %>

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        <% @messages.each do |message| %>
        	<div><strong><%= message.user.profile.first_name %>:&nbsp;</strong><%= message.body %></div>

SELECT COUNT(*) FROM "requests" WHERE "requests"."chatroom_id" = ?  [["chatroom_id", 1]]
---
				<% if @chatroom.chatroom_users.exists?(user_id: current_user.id) %>
				<h5 class="title"><%=@chatroom.requests.count%>&nbsp;request(s)</h5>