app/views/users/show.html.erb

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
---
			</div>
				<div class="profile-user-name"><%= @user.profile.first_name %></div>&nbsp;