app/views/pages/home.html.erb

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
---
        <%= f.select :genderpreference, ['Only Male','Only Female', 'Must Include Male', 'Must Include Female', 'Does Not Matter'], class: 'input-1' %>
        <% if !current_user.profile.collegeemail.blank? %>

SELECT  "chatroom_users".* FROM "chatroom_users" WHERE "chatroom_users"."chatroom_id" = ? LIMIT ?  [["chatroom_id", 1], ["LIMIT", 3]]
SELECT "chatrooms".* FROM "chatrooms"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      	       <%= link_to "Members", chatroom_path(chatroom.id) %><br><br>
      	       <% chatroom.chatroom_users.limit(3).each do |x| %>
      	         <div class="post-image">
      	         <% @conversation_member = User.find(x.user_id) %><% @conversation_member = User.find(@conversation_member.id) %>

SELECT COUNT(*) FROM "chatroom_users" WHERE "chatroom_users"."chatroom_id" = ?  [["chatroom_id", 1]]
---
      	       <% end %>
      	       <% if chatroom.chatroom_users.count > 3 %>

SELECT  "chatroom_users".* FROM "chatroom_users" WHERE "chatroom_users"."chatroom_id" = ? AND "chatroom_users"."admin" = ? ORDER BY "chatroom_users"."id" ASC LIMIT ?  [["chatroom_id", 1], ["admin", true], ["LIMIT", 1]]
SELECT  1 AS one FROM "chatroom_users" WHERE "chatroom_users"."chatroom_id" = ? AND "chatroom_users"."user_id" = ? LIMIT ?  [["chatroom_id", 1], ["user_id", 1], ["LIMIT", 1]]
---
      	       <br><br>
      	       <%if chatroom.collegestudent=='Only Students At My College'%><div class="citychange"><% @fragile= chatroom.chatroom_users.where(admin: true).first%><%@currentadmin=User.find(@fragile.user_id)%><%= Swot::school_name(@currentadmin.profile.collegeemail) %></div><br><%end%>
      	       <div class="citychange"><%= chatroom.city %></div><br>
      	       <%if !chatroom.chatroom_users.exists?(user_id: current_user.id)%>