app/controllers/chatroom_users_controller.rb

SELECT  "chatrooms".* FROM "chatrooms" WHERE "chatrooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "chatroom_users" ("chatroom_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["chatroom_id", 1], ["user_id", 1], ["created_at", 2021-03-01 22:01:00 UTC], ["updated_at", 2021-03-01 22:01:00 UTC]]
SELECT  "chatroom_users".* FROM "chatroom_users" WHERE "chatroom_users"."chatroom_id" = ? AND "chatroom_users"."user_id" = ? ORDER BY "chatroom_users"."id" ASC LIMIT ?  [["chatroom_id", 1], ["user_id", 1], ["LIMIT", 1]]
UPDATE "chatroom_users" SET "admin" = ?, "updated_at" = ? WHERE "chatroom_users"."id" = ?  [["admin", true], ["updated_at", 2021-03-01 22:01:00 UTC], ["id", 1]]
---
	def show
		@chatroom = Chatroom.find(params[:chatroom_id])
		@chatroom_user = @chatroom.chatroom_users.where(user_id: current_user.id).first_or_create
		@chatroom_user.update_attribute(:admin, true)