app/controllers/chatrooms_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    @user = User.find(current_user.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "profiles" SET "search" = ?, "updated_at" = ? WHERE "profiles"."id" = ?  [["search", ""], ["updated_at", 2021-03-01 22:17:02 UTC], ["id", 1]]
SELECT  "chatrooms".* FROM "chatrooms" WHERE "chatrooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "chatroom_users".* FROM "chatroom_users" WHERE "chatroom_users"."chatroom_id" = ? AND "chatroom_users"."user_id" = ? ORDER BY "chatroom_users"."id" ASC LIMIT ?  [["chatroom_id", 1], ["user_id", 1], ["LIMIT", 1]]
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "chatrooms".* FROM "chatrooms" INNER JOIN "chatroom_users" ON "chatrooms"."id" = "chatroom_users"."chatroom_id" WHERE "chatroom_users"."user_id" = ?  [["user_id", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."chatroom_id" = ? ORDER BY "messages"."created_at" DESC  [["chatroom_id", 1]]
---
  def show
    @user = User.find(current_user.id)
    current_user.profile&.update_attribute(:search, '')
    @chatroom = Chatroom.find(params[:id])

    @chatroom_user = @chatroom.chatroom_users.where(user_id: current_user.id).first
    @chatroom_user&.update_attribute(:read, true)
    @messages = @chatroom.messages.order(created_at: :desc).reverse

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def new
    @user = User.find(current_user.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "chatrooms" ("title", "details", "gender", "collegestudent", "minimumage", "maximumage", "created_at", "updated_at", "city") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.find(current_user.id)
    @chatroom = Chatroom.new(chatroom_params)
    if @chatroom.save