app/controllers/messages_controller.rb

  def create
    @chatroom = Chatroom.find(params[:chatroom_id])
    message = @chatroom.messages.new(message_params)
    message.user = current_user
    message.save
    @chatroom.chatroom_users.each do |x|
---
SELECT  "chatrooms".* FROM "chatrooms" WHERE "chatrooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "messages" ("chatroom_id", "user_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["chatroom_id", 1], ["user_id", 1], ["body", "abc"], ["created_at", 2021-03-01 22:17:10 UTC], ["updated_at", 2021-03-01 22:17:10 UTC]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "chatroom_users".* FROM "chatroom_users" WHERE "chatroom_users"."chatroom_id" = ?  [["chatroom_id", 1]]