app/controllers/pages_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "chatrooms".* FROM "chatrooms"
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "chatroom_users" WHERE "chatroom_users"."chatroom_id" = ?  [["chatroom_id", 1]]
SELECT  "chatroom_users".* FROM "chatroom_users" WHERE "chatroom_users"."chatroom_id" = ? AND "chatroom_users"."admin" = ? ORDER BY "chatroom_users"."id" ASC LIMIT ?  [["chatroom_id", 1], ["admin", true], ["LIMIT", 1]]
SELECT  "chatroom_users".* FROM "chatroom_users" WHERE "chatroom_users"."chatroom_id" = ? LIMIT ?  [["chatroom_id", 1], ["LIMIT", 3]]
SELECT  "chatrooms".* FROM "chatrooms" WHERE "chatrooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def home
    @user = User.find(current_user.id)
    if current_user.profile
      @chatrooms = Chatroom.all

      @results = []
      @chatrooms.each do |x|

        if !(current_user.profile.search.blank?) && !((x.title.downcase.include? current_user.profile.search.downcase)||(x.details.downcase.include? current_user.profile.search.downcase))
          next
        end
        if x.chatroom_users.count==0
          next
        end
        @member = x.chatroom_users.where(admin: true).first
        @adminuser = User.find(@member.user_id)

SELECT COUNT(*) FROM "chatroom_users" WHERE "chatroom_users"."user_id" = ? AND "chatroom_users"."read" = ?  [["user_id", 1], ["read", false]]
SELECT COUNT(*) FROM "requests" WHERE "requests"."chatroom_id" = ?  [["chatroom_id", 1]]
---
      @results.push(x)
      end
    @unread = 0
    @requests =
    @unread = current_user.chatroom_users.where(read: false).count
      current_user.chatroom_users.where(admin: true).each do |x|
        @which = Chatroom.find(x.chatroom_id)
        @requests = @requests + @which.requests.count