app/controllers/profiles_controller.rb

  def create
    # Ensure that we have the user who is filling out form
    @user = User.find(params[:user_id])
    # Create profile linked to this specific user
    @profile = @user.build_profile(profile_params)
    if @profile.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "profiles" ("avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at", "user_id", "first_name", "last_name", "age", "gender", "city", "collegeemail", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def edit
    @user = User.find(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @user = User.find(current_user.id)
    @profile = @user.profile
    if @profile.update_attributes(profile_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "profiles" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "profiles"."id" = ?  [["first_name", "Dhruv"], ["last_name", "Sanchety"], ["updated_at", 2021-02-07 07:44:05 UTC], ["id", 1]]