app/controllers/users_controller.rb

  def show
    if current_user.profile
      current_user.profile.update_attribute(:search, '')
---
UPDATE "profiles" SET "search" = ?, "updated_at" = ? WHERE "profiles"."id" = ?  [["search", ""], ["updated_at", 2021-02-07 07:19:43 UTC], ["id", 1]]